{
  "الاسم": "MOHAMMAD ALI AL'OMARI",
  "البريد_الالكتروني": "mohammadomari8031@gmail.com",
  "الهاتف": "+962 7 87686685",
  "المهارات": [
    "معرفة بأساسيات الشبكات (TCP/IP, DNS, DHCP)",
    "خبرة في تكوين وإدارة أجهزة الشبكة (الموجهات، المفاتيح، جدران الحماية)",
    "فهم لشبكات VPN وVLAN وأمن الشبكات",
    "خبرة في منصات الافتراضية مثل VMware وHyper-V وKVM",
    "قدرة على إعداد وإدارة الآلات الافتراضية والشبكات الافتراضية",
    "إجادة في إدارة أنظمة التشغيل Windows Server",
    "خبرة في تثبيت وتكوين وصيانة بيئات أنظمة التشغيل",
    "معرفة بحلول النسخ الاحتياطي والتخطيط لاستعادة الكوارث",
    "خبرة في برامج وتقنيات النسخ الاحتياطي لحماية البيانات واستعادتها",
    "فهم لأفضل ممارسات الأمن السيبراني، بما في ذلك جدران الحماية وأنظمة الكشف/الوقاية من التسلل والتشفير",
    "قدرة على تنفيذ وإدارة السياسات والممارسات الأمنية",
    "مهارات تحليلية قوية لتشخيص وحل المشكلات التقنية المعقدة بفعالية",
    "قدرة على التفكير النقدي والإبداعي لإيجاد حلول تحت الضغط",
    "مهارات تواصل شفهي وكتابي واضحة وموجزة",
    "قدرة على شرح المفاهيم التقنية لأصحاب المصلحة غير التقنيين",
    "فعالية في تحديد أولويات المهام وإدارة الوقت للتعامل مع مسؤوليات متعددة",
    "قدرة على الوفاء بالمواعيد النهائية وإدارة الأحمال بكفاءة",
    "مهارات في العمل التعاوني مع محترفي تكنولوجيا المعلومات الآخرين والأقسام والموردين",
    "قدرة على المساهمة في أهداف الفريق ودعم الأهداف الجماعية",
    "مرونة للتكيف مع التقنيات والعمليات والمتطلبات المتغيرة",
    "استعداد للتعلم وتحديث المهارات مع تطور التكنولوجيا"
  ],
  "الخبرة": "محترف تكنولوجيا المعلومات حاصل على دبلوم في أمن الشبكات والمعلومات. يمتلك خبرة عملية واسعة في صيانة الكمبيوتر، بما في ذلك الجوانب البرمجية والعتادية. بالإضافة إلى ذلك، لدي اهتمام قوي بإدارة الخوادم وطموح واضح لتوسيع مهاراتي في هذا المجال. أتميز في تشخيص وحل المشكلات بكفاءة وتطوير وتنفيذ استراتيجيات الأمان لضمان حماية البيانات والأنظمة.",
  "التعليم": "دبلوم في أمن الشبكات والمعلومات من جامعة البلقاء التطبيقية، إربد - 2022",
  "الملخص": "محترف تكنولوجيا المعلومات حاصل على دبلوم في أمن الشبكات والمعلومات. يمتلك خبرة عملية واسعة في صيانة الكمبيوتر وإدارة الخوادم. يسعى لتطبيق مهاراته وشغفه في بيئة عمل ديناميكية لتحقيق أهداف تقنية مبتكرة وتعزيز أداء الأنظمة.",
  "الثقة": {
    "الاسم": 100,
    "البريد_الالكتروني": 100,
    "الهاتف": 100,
    "المهارات": 100,
    "الخبرة": 100,
    "التعليم": 100
  },
  "is_valid_cv": true,
  "output_language": "ar"
}