[
  {
    "id": "d34a527f-b79d-4124-9d57-d523cf9fb616",
    "title": "Software Engineer",
    "description": "About the request:\nWe are looking for a Software Engineer that will be in charge of end-to-end Real-Time\nCommunication software development for our life-saving platform. You will be designing\nand implementing high-performance VoIP services/ Streaming architecture, in order to\nprovide people the help they need in emergency situations.\nDevelopment of core RTC components from client level up to the server-side,\nimplementing highly scalable real-time communication infrastructure for emergency\nservices.\nWorking on multi-platform environments with mobile clients, VoIP and Streaming\nclustered servers, and on command and control systems and emergency end-devices.\nYou will be working on a wide variety of RTC open-source projects and components:\nWebRTC (Internals and API's), HTTP Streaming, Media frameworks and media engines\n(GStreamer, FFmpeg), B\\W Estimation, Video and Audio codecs (VP8/9, H.264/5 ,\nSVC, Opus, AAC).\nAbout the client:\nWe’re on a mission to help emergency call centers save lives every day. As the leader\nin emergency collaboration technologies, we’re building a platform that brings\ngame-changing capabilities to people in crisis, such as live video, instant chat, and\nlocation tracking. Our platform unifies the flow of life-saving information to emergency\ncall centers, so they can handle emergencies faster than ever, and get to the right\npeople, in the right place, at the right time. We currently provide services to over 400\nmillion people in over eight countries around the world, and partner with Google, Cisco,\nAmazon, and Microsoft to deliver life-saving technologies.\nLocation: Remotely, with a client in New York.\nAbout Job: Full Time.\nSalary Range: It depends on the years of experience and level of education\nMENA Alliances Inc., 2021_Job Description\nRequirements:\n● At least 5 years of hands-on experience in Real-time communication\ndevelopment (Video/Audio Streaming)\n● Strong OOP skills, fluent with C++ Standard Library.\n● Extensive knowledge and experience with Multithreading and Networking.\n● Deep knowledge and experience with VoIP Stacks, SIP Clients and Servers,\nRTSP, HTTP Streaming/HLS.\n● Video\\Audio codes, packetization, encryption, and transport.\n● Deep knowledge and experience with Video and Audio Streaming.\n● Strong OOD and Design Patterns skills.\n● Skilled and independent architect and developer capable of researching and\nhandling challenging engineering and development tasks.\nAdvantages:\n● Knowledge in WebRTC\n● Experience with Janus server.\n● Experience with Wowza streaming engine.\n● Docker and Kubernetes experience.\nMENA Alliances Inc., 2021_Job Description",
    "created_at": "2026-01-25T22:56:35.517493",
    "selected": false
  },
  {
    "id": "6738a77d-775b-4158-abad-ce1c68fda4d2",
    "title": "Mobile Developer",
    "description": "About the job\r\nWe looking for Digital Banking / Mobile Software Engineer, Responsible for designing, developing, and maintaining cutting-edge mobile applications.\r\n\r\n\r\nRole and Responsibilities:\r\n\r\nMobile App Development: Design, build, and maintain mobile applications using Flutter framework to deliver an exceptional digital banking experience to our customers.\r\nCode Quality and Efficiency: Write clean, maintainable, and efficient code following best practices and coding standards. Conduct code reviews and contribute to improving the overall codebase.\r\nUI/UX Implementation: Collaborate with designers to implement intuitive and visually appealing user interfaces. Ensure a consistent and polished look and feel across the application.\r\nIntegration with Backend: Work closely with backend developers to integrate frontend applications with server-side APIs, ensuring data consistency and efficient communication.\r\nPerformance Optimization: Identify and address performance bottlenecks in the application. Optimize app performance to ensure smooth user experience across various devices.\r\nSecurity and Privacy: Implement security measures to safeguard user data and ensure compliance with data privacy regulations. Stay updated with the latest security trends and best practices.\r\nBug Fixing and Maintenance: Troubleshoot and debug issues as they arise. Regularly update and maintain the application to provide the best possible user experience.\r\nContinuous Learning: Stay up to date with the latest developments in mobile app development, Flutter, and related technologies. Share knowledge and insights with the team.\r\nAgile Collaboration: Participate in Agile development processes, attend stand-up meetings, and provide input during sprint planning and retrospectives.\r\nInnovation and Ideation: Contribute innovative ideas to enhance the digital banking app, improve user engagement, and explore new features.\r\nDocument mobile architecture, design decisions, and technical solutions for reference and knowledge sharing.\r\n\r\n\r\nQualifications & Competencies:\r\n\r\nBachelor’s degree in computer science, Software Engineering, or any related field.\r\n2+ years of experience in mobile apps development.\r\nExpert as a Mobile App Developer, with a strong portfolio of Flutter-based applications.\r\nSolid understanding of the Flutter framework, Dart programming language, and mobile app architecture.\r\nExperience with RESTful APIs and backend integration.\r\nKnowledge of UI/UX design principles and ability to work closely with designers.\r\nFamiliarity with version control systems, such as Git.\r\nStrong problem-solving skills and attention to detail.\r\nExcellent communication and teamwork abilities.\r\nCertifications in mobile app development or Flutter are a plus.",
    "created_at": "2026-02-01T15:57:25.903146",
    "selected": true
  },
  {
    "id": "26fc41eb-a9b0-4d84-b3e7-0d0eac512f58",
    "title": "Full Stack Developer",
    "description": "Full Stack Developer\nPosition: Full Stack Developer\nLocation: Remote\nEmployment Type: Contract 3-6 months\nAbout the Role:\nWe are looking for a skilled Full Stack Developer with expertise in building and deploying scalable web\napplications using React.js for the frontend and Node.js for the backend, while leveraging AWS\ninfrastructure. You will be responsible for architecting and managing web applications using key AWS\nservices, such as CloudFront for content delivery, Elastic Beanstalk for deployment, and various other\nAWS services like EC2, S3, and RDS. Experience with Continuous Integration/Continuous Deployment\n(CI/CD) pipelines in GitLab is essential for this role. Your focus will be on building efficient, secure, and\nhighly available applications while optimizing for cost and performance.\nKey Responsibilities:\n● Web Development\n○ Develop responsive, high-performance web applications using React.js for\nfrontend and Node.js (Express) for backend.\n○ Build and integrate RESTful APIs and backend services, ensuring seamless\ncommunication between frontend and backend systems.\n○ Optimize applications for scalability, reliability, and maintainability.\n● AWS Cloud Infrastructure\n○ Architect, deploy, and manage web applications on AWS using the following\nservices:\n■ Elastic Beanstalk to simplify deployment and management of web\napplications, ensuring seamless scalability.\n■ CloudFront to deliver content globally with low latency and high transfer\nspeed, integrating with S3 and EC2 to cache and distribute static and\ndynamic content.\n■ EC2 for scalable compute instances, including load balancing using\nElastic Load Balancer (ELB).\n■ S3 for static file hosting and secure storage.\n■ RDS (Relational Database Service) for database management\n(PostgreSQL, MySQL).\n■ Route 53 for DNS management and domain routing.\n■ AWS Lambda for serverless functions to handle on-demand computing\nneeds.\n■ API Gateway for managing and scaling RESTful APIs.\n● CI/CD & Automation\n○ Develop and maintain CI/CD pipelines using GitLab for automated testing,\nintegration, and deployment of applications.\n○ Automate deployments to Elastic Beanstalk and other AWS resources, ensuring\nstreamlined releases and zero downtime.\n○ Use GitLab Runners and AWS tools to implement continuous integration\nworkflows, including automated testing, building, and monitoring.\n● Security & Monitoring\n○ Implement AWS best practices for security, including IAM roles, security groups,\nencryption, and access controls.\n○ Set up monitoring and logging systems using CloudWatch, and configure alerts\nand notifications via SNS to ensure the application’s performance and uptime.\n○ Regularly review and audit system security, performance, and cost-efficiency.\n● Collaboration & Agile Practices\n○ Work closely with product managers, designers, and other developers to define,\ndesign, and ship new features in an agile environment.\n○ Participate in code reviews, sprint planning, and retrospectives to ensure\ncollaborative and timely delivery of features.\n○ Document code, AWS infrastructure configurations, and CI/CD processes for clear\ncommunication across teams.\nRequirements:\n● Bachelor's degree in Computer Science, Engineering, or equivalent experience.\n● 3+ years of experience as a Full Stack Developer.\n● Expertise in frontend development using React.js and backend development using\nNode.js (Express).\n● Hands-on experience with Elastic Beanstalk for managing web application deployments.\n● Proven experience with CloudFront for content delivery and optimizing web performance\nthrough caching and CDN integration.\n● Strong knowledge of AWS services, including EC2, S3, RDS, CloudFront, Elastic Load\nBalancer, and Route 53.\n● Experience with GitLab CI/CD pipelines for automating testing, builds, and deployments.\n● Familiarity with containerization (Docker) and orchestration (Kubernetes) is a plus.\n● Proficiency in using Git for version control and managing collaborative development\nworkflows.\n● Solid understanding of AWS security best practices (IAM, VPC, encryption).\n● Experience with databases such as PostgreSQL, MySQL, or DynamoDB.\nNice to Have:\n● Experience with serverless technologies like AWS Lambda and API Gateway.\n● Knowledge of Infrastructure as Code (IaC) using Terraform or AWS CloudFormation.\n● Familiarity with AWS Amplify for full-stack app deployment.\n● Experience with GraphQL APIs and real-time data services.\nBenefits:\n● Fixed contract rate for the project with a time frame to finish it, if you finish early you keep\nthe money.\n● Flexible work hours and remote work.\nHow to Apply: Please send your resume, GitHub portfolio to asweed@sweedco.com with the\nsubject line \"Full Stack Developer Application – [Your Name].\"\nNote: Interviews will be held online and work will be remote, starting date is as soon as possible.",
    "created_at": "2026-02-09T22:32:32.587344",
    "selected": false
  },
  {
    "id": "bde54f63-c536-45a5-9cb8-f498c9aebd35",
    "title": "Senior Integration",
    "description": "Job Title:\nSenior Integration & Data Migration Developer\nJob Location:\nRiyadh\nResponsibilities:\n• Collaborate with Business Analysts (BAs) to understand business processes and identify\ntechnical implications.\n• Analyze and interpret client technical requirements from infrastructure, integration, and data\nperspectives.\n• Participate in discovery sessions with client technical stakeholders to gather technical and\narchitectural needs.\n• Define and document technical scope (integration/data migration) as part of the overall\nsolution design.\n• Design scalable and secure integration solutions with external systems (ERP, legacy\nplatforms, APIs, etc.).\n• Define integration architecture using REST/SOAP APIs, OData, or middleware.\n• Coordinate and align integration approaches with the Creatio technical lead/team for best\npractices and platform alignment.\n• Develop or supervise the implementation of custom integrations and ensure proper\nversioning, logging, and monitoring practices.\n• Analyze source data structures and define data migration strategy including transformation,\ncleansing, and mapping.\n• Define migration phases (e.g., trial, delta, final cutover) and tools/scripts required (Creatio\nData Import tools, SQL, ETL tools).\n• Oversee or execute data migration activities while ensuring data integrity, consistency, and\nminimal downtime.\n• Handle error management, reconciliation, and reporting of data migration status.\n• Prepare comprehensive technical specifications and scope documentation for integrations\nand data migration.\n• Maintain clear and versioned documentation covering architecture diagrams, endpoint\nmappings, data dictionaries, and transformation logic.\n• Define and execute integration/data migration test cases and coordinate with QA and UAT\nteams.\n• Support client-side testing by preparing test data and helping simulate end-to-end\nintegration scenarios.\n• Troubleshoot and resolve technical issues during testing and deployment phases.\n• Act as the primary technical point of contact between your team, the client’s IT team, and\nCreatio's technical experts.\n• Coordinate with Creatio technical team on technical escalations, performance optimizations,\nand platform-specific guidelines.\n• Provide regular updates on technical deliverables, risks, and dependencies to the Project\nManager/Technical Lead.\n• Provide post-deployment support for integration and migration issues during stabilization.\n• Support handover to managed services team including documentation, walkthroughs, and\nknowledge transfer sessions.\nRequirements:\n• Bachelor’s degree in Computer Science or equivalent.\n• Experience with REST/SOAP APIs, SQL, ETL processes, middleware (e.g., IBM ESB), and data\nmapping techniques.\n• Experience in CRM, ITSM, Business Process Management, Low code / No code Projects\n(Preferred)\n• knowledge of Creatio platform architecture, integration frameworks, and tools (Preferred)\n• Strong communication skills to interface with both technical and business stakeholders.\n• Experience in documenting technical requirements and preparing scope/solution design\ndocuments.\n• Familiarity with data privacy, security, and compliance practices.\n• English level — Upper-intermediate or higher",
    "created_at": "2026-02-09T22:35:20.488822",
    "selected": false
  },
  {
    "id": "8280c418-15f3-4e30-b153-76c4621ab2ae",
    "title": "Flutter Developer",
    "description": "Job Title: Flutter Developer\nJob Summary\nWe are looking for a skilled Flutter Developer to design, develop, and maintain cross-\nplatform mobile applications for Android and iOS. The ideal candidate has strong\nexperience with Dart, modern mobile development practices, and a passion for building\nhigh-quality, user-friendly applications.\nKey Responsibilities\n• Develop and maintain mobile applications using Flutter and Dart\n• Build reusable, clean, and efficient code for cross-platform deployment\n• Collaborate with UI/UX designers to implement responsive and intuitive interfaces\n• Integrate RESTful APIs and third-party services\n• Optimize applications for performance, scalability, and reliability\n• Debug, test, and maintain existing applications\n• Participate in code reviews and follow best development practices\n• Work closely with backend, QA, and product teams\nRequired Skills & Qualifications\n• Proven experience as a Flutter Developer\n• Strong knowledge of Dart and Flutter framework\n• Experience with state management (e.g. Provider, Riverpod, Bloc, GetX)\n• Familiarity with REST APIs, JSON, and HTTP methods\n• Understanding of mobile app architecture and design patterns\n• Experience with Git or other version control systems\n• Ability to write clean, maintainable, and well-documented code\nPreferred Qualifications\n• Experience publishing apps to Google Play Store and Apple App Store\n• Knowledge of Firebase (Auth, Firestore, Push Notifications)\n• Familiarity with CI/CD pipelines for mobile apps\n• Understanding of Agile/Scrum development methodologies\nSoft Skills\n• Strong problem-solving skills\n• Good communication and teamwork abilities\n• Attention to detail\n• Ability to manage time and meet deadlines",
    "created_at": "2026-02-09T22:39:44.608230",
    "selected": false
  }
]